app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "content", "created_at", "updated_at") VALUES ('The Edison of India: The Inspiring Story of GD Naidu', 'Gopalaswamy Doraiswamy Naidu, popularly known as GD Naidu, was a name synonymous with innovation, entrepreneurship, and relentless pursuit of knowledge in India.  He wasn''t just an inventor; he was a visionary, a self-made man who defied conventions and left an indelible mark on the industrial landscape of the nation.  Often called the "Edison of India," his story is one of perseverance, ingenuity, and a deep-rooted commitment to progress.
INSERT INTO "posts" ("title", "content", "created_at", "updated_at") VALUES ('TEST', '...All The Best...', '2025-02-19 18:38:06.342328', '2025-02-19 18:38:06.342328') RETURNING "id"
---
    def create
        @post = Post.new(post_params)
<<<<<<< HEAD
        if @post.save
            redirect_to @post, notice: 'Post was successfully created.'
=======
        if params[:post][:image].present?
            @post.image.attach(params[:post][:image])

UPDATE "posts" SET "updated_at" = '2025-02-19 18:38:55.357313' WHERE "posts"."id" = 7
---
    def update
        if @post.update(post_params)

SELECT "posts".* FROM "posts" WHERE "posts"."id" = 7 LIMIT 1
---
    def upload_image
        @post = Post.find(params[:id])

SELECT "posts".* FROM "posts" WHERE "posts"."id" = 7 LIMIT 1
---
    def save_image
        @post = Post.find(params[:id])